'''
 Задание:
Пользователь вводит количество элементов будущего списка
После этого по очереди по одной вводит любые цифры
Сохранить цифры в список
Отсортировать список по возрастанию и вывести на экран
Пример работы: Введите количество элементов: 3
Введите 1 элемент: 5
Введите 2 элемент: 2
Введите 3 элемент: 4
Вывод: [2, 4, 5]
'''


list_len = ''
while not list_len.isdigit():
    list_len = input('Введите количество элементов: ')

list_of_elements = [] # готовим пустой список

for i in range(int(list_len)): # запросим в цикле каждый элемент
    element = '' # инициируем переменную для каждого круга цикла
    while not element.isdigit():   # будем запрашивать только цифры
        element = input(f'Введите {i} элемент: ')
    list_of_elements.append(int(element))

list_of_elements.sort()
print(f'Ваш отсортированный список: {list_of_elements}')