'''
Задание:

Пользователь вводит элементы 1-го списка (по очереди как в МОДУЛЬ 1 или вместе как в МОДУЛЬ 2)
Затем он вводит элементы 2-го списка
Удалить из первого списка элементы присутствующие во 2-ом и вывести результат на экран
Пример работы: Введите элементы 1-го списка: 1,2,3,4,5
Введите элементы 2-го списка: 2,5
Результат: 1,3,4

Предлагаю проверить работу программы на разных списках, чтобы убедиться что она работает верно
'''

# вводим первый список
list1_of_user = ''
str1_of_user = input('Введите элементы 1 списка через запятую: ')
list1_of_user = str1_of_user.replace(',', ' ').replace('/', ' ').replace(';', ' ')
list1 = list(list1_of_user.split())

# Вводим второй список
list2_of_user = ''
str2_of_user = input('Введите элементы 2 списка через запятую: ')
list2_of_user = str2_of_user.replace(',', ' ').replace('/', ' ').replace(';', ' ')
list2 = list(list2_of_user.split())

# пройдемся по элементам второго спика:
for element in list2:
    list1.remove(element)

print(f'Результат: {list1}')